{
  "backend/main.mo": "Main actor defining crash record data types (including disaster crash support with multiple aircraft), CRUD operations, validation functions for registration and data sources, and query endpoints with filtering for fantasy and disaster crashes.",
  "backend/migration.mo": "Migration module that transforms OldCrashRecord to NewCrashRecord by adding isDisasterCrash and involvedAircraft fields, preserving existing data while extending the schema.",
  "feature_evidence.json": "Feature evidence report documenting five implemented features for disaster crash support: form checkbox, dashboard filter toggle, severity warning modal, query hook parameter, and crash list badge display.",
  "frontend-file-summaries.txt": "JSON object containing one-line summaries of all frontend files, describing components for crash tracking UI including forms, lists, details, maps, 3D reconstruction, and hooks with disaster crash filtering support.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color variables for light and dark themes using subdued slate blues and grays appropriate for historical tragedy documentation.",
  "frontend/index.html": "HTML entry point with root div and module script reference for the React application titled 'Historical Plane Crash Tracker'.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for dashboard, add crash, and crash detail pages, wrapped in ThemeProvider and including Toaster for notifications.",
  "frontend/src/components/AddInvestigationEntryForm.tsx": "Form component for adding investigation timeline entries with timestamp, description, author, tags, media URLs, and photo uploads with progress tracking, using mutations to add entries and attach photos.",
  "frontend/src/components/CrashDetailsPanel.tsx": "Displays detailed crash information including casualty statistics, verification status badges, fatality/survival rates with progress bars, and handles both single and disaster crashes with multiple aircraft.",
  "frontend/src/components/CrashListItem.tsx": "Renders a clickable card for a crash record in a list view, showing airline/flight info, date, aircraft type, location, verification badges, and casualty statistics.",
  "frontend/src/components/CrashReconstruction3D.tsx": "Provides a 3D visualization of aircraft crashes using Three.js/React Three Fiber, rendering a simplified aircraft model with damage effects colored by phase of flight and scattered debris.",
  "frontend/src/components/CrashRecordForm.tsx": "Form component for adding new crash records with fields for crash details, aircraft info, casualties, and support for disaster crashes with multiple involved aircraft entries.",
  "frontend/src/components/FlightPathMap.tsx": "Displays crash location coordinates with a placeholder for an interactive map and flight path visualization, showing known vs speculative route points when available.",
  "frontend/src/components/InvestigationTimeline.tsx": "Renders a vertical timeline of investigation entries with expandable cards showing timestamps, titles, descriptions, tags, authors, and attached photos/videos.",
  "frontend/src/components/Layout.tsx": "Main layout component with header, navigation, and footer. Includes links to dashboard and add-crash pages, plus branding for Aviation Crash Archive and caffeine.ai attribution.",
  "frontend/src/hooks/useActor.ts": "React hook that manages the backend actor instance using React Query. Creates authenticated or anonymous actors based on Internet Identity state and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication. Manages login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching crash records, flight paths, and investigation data from the backend actor. Includes queries for filtering by date range, phase, keyword search, and survivor stories.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom design tokens for light and dark themes. Defines a professional, subdued color palette suitable for historical documentation with earth tones and high contrast.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the App component into the root DOM element.",
  "frontend/src/pages/AddCrashPage.tsx": "Page component for adding new crash records. Displays a card with CrashRecordForm and a back button to return to the dashboard.",
  "frontend/src/pages/CrashDetailPage.tsx": "Detail page for individual crash records with tabs for flight path map, 3D reconstruction, and investigation timeline. Displays crash metadata, aircraft info, and location coordinates with loading and error states.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard page component that displays a filterable/sortable list of crash records with search, phase filtering, casualty sorting, and toggles for fantasy and disaster crashes (with warning dialog for disaster crashes).",
  "frontend/src/utils/aircraftModelMapping.ts": "Utility module that maps aircraft type strings to 3D model identifiers, supporting exact and partial matching with fallback to a generic model.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes using OKLCH color space, extended theme properties, animations, and typography/container query plugins.",
  "project_state.json": "Project metadata file documenting the application architecture, features, and requirements for a historical plane crash tracking system with 3D visualization, manual data entry, and fantasy/disaster crash classification."
}