{
  "backend/main.mo": "Main Motoko actor defining crash record types (coordinates, investigation entries, flight paths, aircraft, casualties) and CRUD operations including addCrashRecord, attachPhotoToCrashRecord, getCrashRecords with sorting/filtering, and investigation timeline management with blob storage integration.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (manual data entry form, aircraft identification, interactive map, 3D reconstruction, investigation timeline) to their source files, components, and test IDs with confidence levels.",
  "frontend-file-summaries.txt": "JSON object containing one-sentence summaries of all frontend source files including pages, components, utilities, and configuration files.",
  "frontend/index.css": "Global Tailwind CSS styles with custom OKLCH color system defining light and dark mode variables for background, foreground, borders, and semantic colors using subdued slate tones.",
  "frontend/index.html": "HTML entry point for the React application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for dashboard, add crash, and crash detail pages, wrapped in ThemeProvider and including Toaster for notifications.",
  "frontend/src/components/AddInvestigationEntryForm.tsx": "Form component for adding investigation timeline entries with fields for timestamp, title, description, author, tags, media URLs, and photo uploads with progress tracking, using React Query mutations.",
  "frontend/src/components/CrashDetailsPanel.tsx": "Component displaying detailed crash casualty statistics with progress bars, survival/fatality rates, crew/passenger breakdown, and aircraft/flight information in a card-based layout.",
  "frontend/src/components/CrashListItem.tsx": "Displays a clickable card for a single crash record with airline/flight info, date, aircraft details, location, and casualty statistics including fatality rate and survivor count.",
  "frontend/src/components/CrashReconstruction3D.tsx": "Renders a 3D visualization of an aircraft crash using Three.js/React Three Fiber, showing a simplified aircraft model with damage effects and debris based on the phase of flight.",
  "frontend/src/components/CrashRecordForm.tsx": "Form component for adding new crash records with fields for date, location, airline, aircraft details, casualties, and crash cause; validates input and navigates to the new record on success.",
  "frontend/src/components/FlightPathMap.tsx": "Displays crash location coordinates with a placeholder for an interactive map; shows flight path legend distinguishing known vs speculative route points when available.",
  "frontend/src/components/InvestigationTimeline.tsx": "Renders a vertical timeline of investigation entries with expandable descriptions, tags, timestamps, author info, and attached photos/videos; includes dialog for adding new entries.",
  "frontend/src/components/Layout.tsx": "Main application layout with sticky header containing logo and navigation, main content area, and footer with attribution and data source information.",
  "frontend/src/hooks/useActor.ts": "React hook that manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity state and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating crash records, including queries for all crashes, date ranges, phases, search, survivor stories, flight paths, and investigation entries, plus mutations for adding, updating, and deleting records.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a professional color palette for light and dark modes, optimized for historical documentation with subdued tones and improved typography for data-heavy content.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/AddCrashPage.tsx": "Page component for adding new crash records, displaying a form within a card layout with navigation back to the dashboard.",
  "frontend/src/pages/CrashDetailPage.tsx": "Detailed crash record view page with tabs for flight path map, 3D reconstruction, and investigation timeline, displaying comprehensive crash information including date, aircraft, location, and casualties.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard page displaying crash statistics cards, search/filter controls, and a sortable list of crash records with filtering by keyword and flight phase.",
  "frontend/src/utils/aircraftModelMapping.ts": "Utility functions for mapping aircraft types to 3D model identifiers, supporting exact and partial matching with fallback to generic models for unsupported aircraft types.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file that defines custom theme extensions including OKLCH color system with CSS variables, custom fonts (Inter, JetBrains Mono), border radius variables, box shadows, and accordion animations. Includes typography, container queries, and animate plugins.",
  "project_state.json": "Project state file describing a historical plane crash tracking application with manual data entry, interactive flight path maps, 3D crash reconstructions using Three.js, investigation timelines with multimedia support, and Motoko backend. Lists five implemented features including data entry forms, aircraft identification, map visualization, 3D viewer, and investigation timeline components."
}