{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add disaster crash tracking system with multiple aircraft support and severity warning filter",
  "requirements": [
    {
      "id": "REQ-24",
      "summary": "Add disaster crash checkbox and multiple aircraft input fields to CrashRecordForm, enabled only when source is verified",
      "acceptanceCriteria": [
        "Checkbox is disabled with tooltip message when sourceVerification field is empty or false",
        "Checkbox enables when sourceVerification field indicates verified source",
        "When checked, form displays repeatable aircraft entry fields (type, registration, airline, casualties)",
        "Users can add/remove aircraft entries dynamically",
        "Form validates at least 2 aircraft are entered when disaster crash is checked"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/CrashRecordForm.tsx",
          "operation": "modify",
          "description": "Add 'Multiple Aircraft Involved (Disaster Crash)' checkbox that is disabled when sourceVerification is false or empty, with tooltip explaining verification requirement. When enabled and checked, display dynamic repeatable input fields for involvedAircraft array entries including aircraft type, registration number, airline, and casualties for each aircraft. Include add/remove buttons for aircraft entries. Add form validation to ensure at least 2 aircraft are entered when isDisasterCrash is true. Update form submission to include isDisasterCrash Boolean and involvedAircraft array in the backend addCrashRecord call."
        }
      ]
    },
    {
      "id": "REQ-25",
      "summary": "Add 'Show Disaster Crashes' toggle filter to DashboardPage that filters the crash list, defaulting to hidden",
      "acceptanceCriteria": [
        "Toggle checkbox labeled 'Show Disaster Crashes' added to filter controls",
        "Filter defaults to unchecked (disaster crashes hidden)",
        "Toggling the filter updates the crash list immediately",
        "Filter state persists during the session"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/DashboardPage.tsx",
          "operation": "modify",
          "description": "Add 'Show Disaster Crashes' checkbox toggle to the existing filter controls section alongside the fantasy crashes filter. Default the state to false (unchecked). Store the filter state in component state and pass it to the useCrashRecords hook via the includeDisasterCrashes parameter. Ensure the filter state persists during the session by using sessionStorage or component state."
        }
      ]
    },
    {
      "id": "REQ-26",
      "summary": "Display severity warning modal when users first enable the disaster crashes filter, requiring acknowledgment before showing content",
      "acceptanceCriteria": [
        "Modal or alert appears when user first checks the disaster crashes filter",
        "Warning message clearly states the content may be graphic or disturbing",
        "User must acknowledge with 'I Understand' button before filter takes effect",
        "If user cancels, the filter remains unchecked",
        "Acknowledgment is remembered for the session (warning only shows once per session)"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/DashboardPage.tsx",
          "operation": "modify",
          "description": "Add a severity warning modal (using shadcn/ui Dialog or AlertDialog component) that appears when the user first checks the 'Show Disaster Crashes' toggle during the session. Display a warning message stating that disaster crash content may contain graphic or disturbing details about multiple aircraft incidents. Include 'I Understand' button to acknowledge and proceed, and 'Cancel' button to dismiss without enabling the filter. Track acknowledgment state in sessionStorage to ensure the warning only appears once per session. Only apply the includeDisasterCrashes=true filter after user acknowledges."
        }
      ]
    },
    {
      "id": "REQ-27",
      "summary": "Update useCrashRecords hook to accept and pass includeDisasterCrashes parameter to backend query",
      "acceptanceCriteria": [
        "useCrashRecords hook accepts includeDisasterCrashes Boolean parameter",
        "Parameter is passed to backend getCrashRecords query",
        "Hook updates queries when includeDisasterCrashes parameter changes"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Update the useCrashRecords hook signature to accept an optional includeDisasterCrashes Boolean parameter (defaulting to false). Pass this parameter to the backend.getCrashRecords() method call alongside the existing includeFantasy parameter. Ensure the query key includes includeDisasterCrashes so queries are properly cached and invalidated when the parameter changes."
        }
      ]
    },
    {
      "id": "REQ-28",
      "summary": "Display 'Disaster Crash' badge with warning styling in CrashListItem when isDisasterCrash is true, showing aircraft count",
      "acceptanceCriteria": [
        "Badge displays 'Disaster Crash' text with warning icon",
        "Badge uses distinct warning color (e.g., orange or red accent)",
        "Badge shows aircraft count (e.g., '3 Aircraft Involved')",
        "Badge appears alongside existing verification status badges"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/CrashListItem.tsx",
          "operation": "modify",
          "description": "Add conditional rendering for a 'Disaster Crash' badge when crashRecord.isDisasterCrash is true. Use shadcn/ui Badge component with variant='destructive' or custom warning styling (orange/red accent). Display warning icon (AlertTriangle or similar from lucide-react) alongside text 'Disaster Crash'. Include aircraft count from involvedAircraft.length in the badge text (e.g., '3 Aircraft Involved'). Position the badge alongside existing verification status badges in the card."
        }
      ]
    },
    {
      "id": "REQ-29",
      "summary": "Display disaster crash information with list of involved aircraft details in CrashDetailsPanel when isDisasterCrash is true",
      "acceptanceCriteria": [
        "Panel shows 'Multiple Aircraft Involved' section when isDisasterCrash is true",
        "Each involved aircraft is listed with type, registration, airline, and casualties",
        "Total casualties across all aircraft are calculated and displayed",
        "Section is not shown for single-aircraft crashes"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/CrashDetailsPanel.tsx",
          "operation": "modify",
          "description": "Add conditional section that renders when crashRecord.isDisasterCrash is true. Display 'Multiple Aircraft Involved' heading with warning styling. Map over crashRecord.involvedAircraft array to render each aircraft entry with aircraft type, registration number, airline, and casualties (fatalities, survivors, total aboard) in a card or list format. Calculate and display total casualties across all involved aircraft by summing fatalities and totalAboard from each entry. Do not render this section when isDisasterCrash is false."
        }
      ]
    }
  ]
}